---
kind: property
id: P:Autodesk.Revit.DB.MEPCurve.Diameter
zh: 直径、管径
source: html/ef86c674-b088-40b1-0b28-3b91a01c7b30.htm
---
# Autodesk.Revit.DB.MEPCurve.Diameter Property

**中文**: 直径、管径

The diameter of the MEP curve.

## Syntax (C#)
```csharp
public double Diameter { get; }
```

## Remarks
This property is used to retrieve the diameter of the MEP curve.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the MEP curve's Shape is not round.